/*
В срезе чисел найди все последовательности из 3+ одинаковых чисел подряд.

Пример:
	[1, 2, 2, 2, 3, 3, 4, 4, 4, 4] →
	Найдены: [2,2,2] - повторений: 3 [4,4,4,4] - повторений: 4
	nums := []int{1, 2, 2, 2, 3, 3, 4, 4, 4, 4, 4, 4,5, 6, 6, 7, 7, 7, 7, 7}
*/

package main

import (
	"fmt"
)

func searchSub(nums *[]int) {
	// Используем указатель на слайс, чтобы избежать копирования данных

	const searchCount = 3 // Требуемое количество повторений подряд
	var count int         // Количество повторений текущего значения

	for i, v := range *nums {
		count++ // Увеличиваем счетчик повторений текущего значения

		// Достигли последнего элемента или следующий элемент не равен текущему
		if i == len(*nums)-1 || v != (*nums)[i+1] {
			// Набралось требуемое количество повторений
			if searchCount <= count {
				fmt.Printf("%d - повторений: %d\n", v, count)
			}

			count = 0 // Обнуляем счетчик
		}
	}
}

func main() {
	nums := []int{1, 2, 2, 2, 3, 3, 4, 4, 4, 4, 4, 4, 5, 6, 6, 7, 7, 7, 7, 7}
	searchSub(&nums)
}
